{"keras_version": "1.2.0", "config": {"name": "model_1", "layers": [{"inbound_nodes": [], "name": "input_1", "config": {"name": "input_1", "batch_input_shape": [null, 18, 80, 3], "input_dtype": "float32", "sparse": false}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution2d_1", "config": {"bias": true, "activation": "linear", "trainable": true, "nb_filter": 16, "nb_row": 5, "W_constraint": null, "b_constraint": null, "b_regularizer": null, "subsample": [1, 1], "nb_col": 5, "init": "glorot_uniform", "name": "convolution2d_1", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "border_mode": "valid", "dim_ordering": "tf", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "maxpooling2d_1", "config": {"trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_1", "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "activation_1", "config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_1", 0, 0]]], "name": "convolution2d_2", "config": {"bias": true, "activation": "linear", "trainable": true, "nb_filter": 32, "nb_row": 3, "W_constraint": null, "b_constraint": null, "b_regularizer": null, "subsample": [1, 1], "nb_col": 3, "init": "glorot_uniform", "name": "convolution2d_2", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "border_mode": "valid", "dim_ordering": "tf", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "maxpooling2d_2", "config": {"trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_2", "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "activation_2", "config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_2", 0, 0]]], "name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_1", "config": {"b_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "W_constraint": null, "bias": true, "b_regularizer": null, "input_dim": 1152, "init": "glorot_uniform", "output_dim": 512, "name": "dense_1", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_1", 0, 0]]], "name": "dropout_1", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_1", 0, 0]]], "name": "activation_3", "config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_3", 0, 0]]], "name": "dense_2", "config": {"b_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "W_constraint": null, "bias": true, "b_regularizer": null, "input_dim": 512, "init": "glorot_uniform", "output_dim": 50, "name": "dense_2", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_2", 0, 0]]], "name": "activation_4", "config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_4", 0, 0]]], "name": "dense_3", "config": {"b_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "W_constraint": null, "bias": true, "b_regularizer": null, "input_dim": 50, "init": "glorot_uniform", "output_dim": 1, "name": "dense_3", "W_regularizer": null}, "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_3", 0, 0]]}, "class_name": "Model"}