{"class_name": "Model", "keras_version": "1.2.0", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 18, 80, 3], "sparse": false, "input_dtype": "float32", "name": "input_1"}, "inbound_nodes": []}, {"class_name": "Convolution2D", "name": "convolution2d_1", "config": {"subsample": [1, 1], "bias": true, "activity_regularizer": null, "nb_filter": 16, "trainable": true, "activation": "linear", "nb_col": 3, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "border_mode": "valid", "nb_row": 3, "name": "convolution2d_1", "W_regularizer": null, "dim_ordering": "tf"}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_1", "config": {"trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_1", "pool_size": [2, 2], "dim_ordering": "tf"}, "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_2", "config": {"subsample": [1, 1], "bias": true, "activity_regularizer": null, "nb_filter": 64, "trainable": true, "activation": "linear", "nb_col": 3, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "border_mode": "valid", "nb_row": 3, "name": "convolution2d_2", "W_regularizer": null, "dim_ordering": "tf"}, "inbound_nodes": [[["activation_1", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_2", "config": {"trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_2", "pool_size": [2, 2], "dim_ordering": "tf"}, "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"class_name": "Activation", "name": "activation_2", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["activation_2", 0, 0]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"b_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 256, "W_constraint": null, "b_regularizer": null, "activation": "linear", "bias": true, "input_dim": 3456, "init": "glorot_uniform", "name": "dense_1", "W_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"name": "dropout_1", "trainable": true, "p": 0.4}, "inbound_nodes": [[["dense_1", 0, 0]]]}, {"class_name": "Activation", "name": "activation_3", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"b_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 50, "W_constraint": null, "b_regularizer": null, "activation": "linear", "bias": true, "input_dim": 256, "init": "glorot_uniform", "name": "dense_2", "W_regularizer": null}, "inbound_nodes": [[["activation_3", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_2", "config": {"name": "dropout_2", "trainable": true, "p": 0.4}, "inbound_nodes": [[["dense_2", 0, 0]]]}, {"class_name": "Activation", "name": "activation_4", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"class_name": "Dense", "name": "dense_3", "config": {"b_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 1, "W_constraint": null, "b_regularizer": null, "activation": "linear", "bias": true, "input_dim": 50, "init": "glorot_uniform", "name": "dense_3", "W_regularizer": null}, "inbound_nodes": [[["activation_4", 0, 0]]]}], "output_layers": [["dense_3", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}}