{"keras_version": "1.2.0", "class_name": "Model", "config": {"layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"input_dtype": "float32", "batch_input_shape": [null, 18, 80, 3], "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "convolution2d_1", "class_name": "Convolution2D", "config": {"name": "convolution2d_1", "trainable": true, "nb_filter": 16, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_row": 3, "dim_ordering": "tf", "W_constraint": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "nb_col": 3, "W_regularizer": null, "border_mode": "valid", "init": "glorot_uniform"}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "maxpooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2]}, "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"name": "convolution2d_2", "class_name": "Convolution2D", "config": {"name": "convolution2d_2", "trainable": true, "nb_filter": 64, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_row": 3, "dim_ordering": "tf", "W_constraint": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "nb_col": 3, "W_regularizer": null, "border_mode": "valid", "init": "glorot_uniform"}, "inbound_nodes": [[["activation_1", 0, 0]]]}, {"name": "maxpooling2d_2", "class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2]}, "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["activation_2", 0, 0]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "W_regularizer": null, "b_constraint": null, "bias": true, "W_constraint": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "input_dim": 3456, "init": "glorot_uniform", "output_dim": 256}, "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.4}, "inbound_nodes": [[["dense_1", 0, 0]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "W_regularizer": null, "b_constraint": null, "bias": true, "W_constraint": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "input_dim": 256, "init": "glorot_uniform", "output_dim": 50}, "inbound_nodes": [[["activation_3", 0, 0]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.4}, "inbound_nodes": [[["dense_2", 0, 0]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "W_regularizer": null, "b_constraint": null, "bias": true, "W_constraint": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "input_dim": 50, "init": "glorot_uniform", "output_dim": 1}, "inbound_nodes": [[["activation_4", 0, 0]]]}], "name": "model_1", "output_layers": [["dense_3", 0, 0]], "input_layers": [["input_1", 0, 0]]}}