{"class_name": "Model", "keras_version": "1.2.0", "config": {"layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, 37, 160, 3], "input_dtype": "float32"}}, {"name": "convolution2d_1", "class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"nb_col": 3, "dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "convolution2d_1", "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "nb_row": 3, "activation": "linear", "nb_filter": 16, "init": "glorot_uniform", "trainable": true, "bias": true, "b_regularizer": null, "border_mode": "valid"}}, {"name": "maxpooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1"}}, {"name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "config": {"p": 0.2, "name": "dropout_1", "trainable": true}}, {"name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["dropout_1", 0, 0]]], "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"name": "convolution2d_2", "class_name": "Convolution2D", "inbound_nodes": [[["activation_1", 0, 0]]], "config": {"nb_col": 3, "dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "convolution2d_2", "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "nb_row": 3, "activation": "linear", "nb_filter": 64, "init": "glorot_uniform", "trainable": true, "bias": true, "b_regularizer": null, "border_mode": "same"}}, {"name": "maxpooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "config": {"dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_2"}}, {"name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "config": {"p": 0.2, "name": "dropout_2", "trainable": true}}, {"name": "activation_2", "class_name": "Activation", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"name": "convolution2d_3", "class_name": "Convolution2D", "inbound_nodes": [[["activation_2", 0, 0]]], "config": {"nb_col": 3, "dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "convolution2d_3", "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "nb_row": 3, "activation": "linear", "nb_filter": 128, "init": "glorot_uniform", "trainable": true, "bias": true, "b_regularizer": null, "border_mode": "same"}}, {"name": "maxpooling2d_3", "class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "config": {"dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_3"}}, {"name": "dropout_3", "class_name": "Dropout", "inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "config": {"p": 0.2, "name": "dropout_3", "trainable": true}}, {"name": "activation_3", "class_name": "Activation", "inbound_nodes": [[["dropout_3", 0, 0]]], "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["activation_3", 0, 0]]], "config": {"name": "flatten_1", "trainable": true}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0]]], "config": {"activity_regularizer": null, "W_constraint": null, "name": "dense_1", "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "activation": "linear", "bias": true, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "input_dim": 9728, "b_constraint": null, "output_dim": 256}}, {"name": "dropout_4", "class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0]]], "config": {"p": 0.2, "name": "dropout_4", "trainable": true}}, {"name": "activation_4", "class_name": "Activation", "inbound_nodes": [[["dropout_4", 0, 0]]], "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["activation_4", 0, 0]]], "config": {"activity_regularizer": null, "W_constraint": null, "name": "dense_2", "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "activation": "linear", "bias": true, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "input_dim": 256, "b_constraint": null, "output_dim": 50}}, {"name": "dropout_5", "class_name": "Dropout", "inbound_nodes": [[["dense_2", 0, 0]]], "config": {"p": 0.2, "name": "dropout_5", "trainable": true}}, {"name": "activation_5", "class_name": "Activation", "inbound_nodes": [[["dropout_5", 0, 0]]], "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["activation_5", 0, 0]]], "config": {"activity_regularizer": null, "W_constraint": null, "name": "dense_3", "W_regularizer": null, "activation": "linear", "bias": true, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "input_dim": 50, "b_constraint": null, "output_dim": 1}}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_3", 0, 0]]}}