{"keras_version": "1.2.0", "config": {"layers": [{"name": "input_1", "inbound_nodes": [], "config": {"batch_input_shape": [null, 18, 80, 3], "name": "input_1", "input_dtype": "float32", "sparse": false}, "class_name": "InputLayer"}, {"name": "convolution2d_1", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"nb_row": 3, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "convolution2d_1", "b_regularizer": null, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "dim_ordering": "tf", "border_mode": "valid", "subsample": [1, 1], "trainable": true, "nb_filter": 16, "activation": "linear"}, "class_name": "Convolution2D"}, {"name": "maxpooling2d_1", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"dim_ordering": "tf", "strides": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_1", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"name": "activation_1", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"name": "convolution2d_2", "inbound_nodes": [[["activation_1", 0, 0]]], "config": {"nb_row": 3, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "convolution2d_2", "b_regularizer": null, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "dim_ordering": "tf", "border_mode": "valid", "subsample": [1, 1], "trainable": true, "nb_filter": 64, "activation": "linear"}, "class_name": "Convolution2D"}, {"name": "maxpooling2d_2", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "config": {"dim_ordering": "tf", "strides": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_2", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"name": "activation_2", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"name": "flatten_1", "inbound_nodes": [[["activation_2", 0, 0]]], "config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0]]], "config": {"output_dim": 256, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "dense_1", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "activation": "linear", "input_dim": 3456, "trainable": true}, "class_name": "Dense"}, {"name": "dropout_1", "inbound_nodes": [[["dense_1", 0, 0]]], "config": {"trainable": true, "p": 0.4, "name": "dropout_1"}, "class_name": "Dropout"}, {"name": "activation_3", "inbound_nodes": [[["dropout_1", 0, 0]]], "config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"name": "dense_2", "inbound_nodes": [[["activation_3", 0, 0]]], "config": {"output_dim": 50, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "dense_2", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "activation": "linear", "input_dim": 256, "trainable": true}, "class_name": "Dense"}, {"name": "dropout_2", "inbound_nodes": [[["dense_2", 0, 0]]], "config": {"trainable": true, "p": 0.4, "name": "dropout_2"}, "class_name": "Dropout"}, {"name": "activation_4", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"name": "dense_3", "inbound_nodes": [[["activation_4", 0, 0]]], "config": {"output_dim": 1, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "dense_3", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "activation": "linear", "input_dim": 50, "trainable": true}, "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_3", 0, 0]]}, "class_name": "Model"}