{"keras_version": "1.2.0", "class_name": "Model", "config": {"layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 18, 80, 3], "input_dtype": "float32", "sparse": false, "name": "input_1"}}, {"name": "convolution2d_1", "class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"name": "convolution2d_1", "init": "glorot_uniform", "subsample": [1, 1], "nb_filter": 16, "b_constraint": null, "nb_col": 3, "bias": true, "activity_regularizer": null, "nb_row": 3, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null, "border_mode": "same", "trainable": true, "W_regularizer": {"l2": 0.0020000000949949026, "l1": 0.0, "name": "L1L2Regularizer"}}}, {"name": "maxpooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_1", "strides": [2, 2], "trainable": true}}, {"name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"name": "convolution2d_2", "class_name": "Convolution2D", "inbound_nodes": [[["activation_1", 0, 0]]], "config": {"name": "convolution2d_2", "init": "glorot_uniform", "subsample": [1, 1], "nb_filter": 64, "b_constraint": null, "nb_col": 3, "bias": true, "activity_regularizer": null, "nb_row": 3, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null, "border_mode": "same", "trainable": true, "W_regularizer": {"l2": 0.0020000000949949026, "l1": 0.0, "name": "L1L2Regularizer"}}}, {"name": "maxpooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "config": {"border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_2", "strides": [2, 2], "trainable": true}}, {"name": "activation_2", "class_name": "Activation", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["activation_2", 0, 0]]], "config": {"name": "flatten_1", "trainable": true}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0]]], "config": {"output_dim": 256, "name": "dense_1", "input_dim": 5120, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "b_regularizer": null, "trainable": true, "b_constraint": null, "W_regularizer": {"l2": 0.0020000000949949026, "l1": 0.0, "name": "L1L2Regularizer"}}}, {"name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0]]], "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"name": "activation_3", "class_name": "Activation", "inbound_nodes": [[["dropout_1", 0, 0]]], "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["activation_3", 0, 0]]], "config": {"output_dim": 50, "name": "dense_2", "input_dim": 256, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "b_regularizer": null, "trainable": true, "b_constraint": null, "W_regularizer": {"l2": 0.0020000000949949026, "l1": 0.0, "name": "L1L2Regularizer"}}}, {"name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["dense_2", 0, 0]]], "config": {"p": 0.2, "trainable": true, "name": "dropout_2"}}, {"name": "activation_4", "class_name": "Activation", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["activation_4", 0, 0]]], "config": {"output_dim": 1, "name": "dense_3", "input_dim": 50, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "b_regularizer": null, "trainable": true, "b_constraint": null, "W_regularizer": null}}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_3", 0, 0]], "name": "model_1"}}